[
  {
    "id": 1,
    "q": "Which security principle ensures that a subject is granted only the minimum necessary rights to perform a task?",
    "opts": ["Separation of Duties", "Need-to-Know", "Least Privilege", "Defense in Depth"],
    "answer": 2,
    "explain": "The principle of Least Privilege dictates that any user, program, or process should be granted only the bare minimum of permissions necessary to perform its functions.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 2,
    "q": "In cryptography, which type of cipher uses the same key for both encryption and decryption?",
    "opts": ["Asymmetric Cipher", "Public Key Cipher", "Symmetric Cipher", "Hashing Algorithm"],
    "answer": 2,
    "explain": "Symmetric ciphers, such as AES, use a single, shared secret key for both encrypting the plaintext and decrypting the ciphertext.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 3,
    "q": "Which term describes the maximum acceptable period of time a business process can be inoperable after a disaster?",
    "opts": ["MTTR (Mean Time to Repair)", "RPO (Recovery Point Objective)", "RTO (Recovery Time Objective)", "MTBF (Mean Time Between Failures)"],
    "answer": 2,
    "explain": "RTO (Recovery Time Objective) defines the targeted duration of time and service level within which a business process must be restored after a disaster.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 4,
    "q": "Which access control model relies on the operating system kernel to enforce security labels on all subjects and objects?",
    "opts": ["DAC (Discretionary Access Control)", "RBAC (Role-Based Access Control)", "MAC (Mandatory Access Control)", "ABAC (Attribute-Based Access Control)"],
    "answer": 2,
    "explain": "MAC (Mandatory Access Control) is a strict, system-enforced model based on security clearances and labels, commonly used in military or highly secure environments.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 5,
    "q": "Which type of firewall inspects the entire communication session, maintaining information about the state of active connections?",
    "opts": ["Packet-Filtering Firewall", "Application-Level Gateway", "Stateful Inspection Firewall", "Proxy Server"],
    "answer": 2,
    "explain": "Stateful Inspection Firewalls monitor the state of active connections and use this information to make dynamic decisions about which packets to allow.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 6,
    "q": "What is the primary goal of a Denial of Service (DoS) or Distributed Denial of Service (DDoS) attack?",
    "opts": ["Exfiltrate sensitive data", "Gain unauthorized system access", "Compromise the availability of a service", "Install persistent malware"],
    "answer": 2,
    "explain": "The core objective of a DoS/DDoS attack is to consume a target's resources (bandwidth, memory, CPU) to compromise its availability to legitimate users.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 7,
    "q": "Which cryptographic function provides data integrity and is also used in conjunction with a private key to achieve non-repudiation?",
    "opts": ["Symmetric Encryption", "Public Key Encryption", "Hashing", "Stream Cipher"],
    "answer": 2,
    "explain": "Hashing functions (like SHA-256) create a unique fixed-length digest of data, which is essential for verifying data integrity and forms the basis of digital signatures (for non-repudiation).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 8,
    "q": "Which security control category includes periodic audits, vulnerability scanning, and penetration testing?",
    "opts": ["Preventive Control", "Corrective Control", "Detective Control", "Deterrent Control"],
    "answer": 2,
    "explain": "Detective controls, such as audits and scanning, are designed to identify and report on security violations or weaknesses after they have occurred or exist.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 9,
    "q": "In the risk management process, which strategy is employed when the cost of mitigation is greater than the potential loss, and the risk is not critical?",
    "opts": ["Risk Avoidance", "Risk Mitigation", "Risk Acceptance", "Risk Transfer"],
    "answer": 2,
    "explain": "Risk Acceptance means deciding not to take any action to change the likelihood or impact of a risk, and simply bearing the potential consequences.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 10,
    "q": "Which protocol is commonly used to establish secure, encrypted VPN connections at the network layer (Layer 3)?",
    "opts": ["TLS/SSL", "SSH", "IPsec", "HTTPS"],
    "answer": 2,
    "explain": "IPsec (IP Security) is a suite of protocols that secures Internet Protocol (IP) communications by authenticating and encrypting each IP packet.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 11,
    "q": "Which type of backup copies only the files that have changed since the last **full** backup, and does not reset the archive bit?",
    "opts": ["Full Backup", "Incremental Backup", "Differential Backup", "Image Backup"],
    "answer": 2,
    "explain": "Differential backup copies all data changed since the last full backup. It is faster to restore than incremental but requires more storage over time.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 12,
    "q": "What is the security concept that dictates the need for multiple, overlapping security controls to protect a resource?",
    "opts": ["Least Privilege", "Separation of Duties", "Defense in Depth", "Need-to-Know"],
    "answer": 2,
    "explain": "Defense in Depth involves layering multiple, different security controls to prevent a single point of failure from compromising the entire system.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 13,
    "q": "Which component of the PKI system is responsible for verifying the identity of the certificate applicant before issuing a certificate?",
    "opts": ["Certificate Authority (CA)", "Certificate Repository", "Registration Authority (RA)", "End Entity"],
    "answer": 2,
    "explain": "The Registration Authority (RA) is responsible for validating the identity of individuals or organizations requesting a digital certificate from a CA.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 14,
    "q": "Which type of malicious software typically hides its presence by modifying core operating system files or kernel components?",
    "opts": ["Virus", "Trojan Horse", "Rootkit", "Worm"],
    "answer": 2,
    "explain": "A Rootkit is designed to hide the existence of other malware or unauthorized activities, often operating at the kernel level for deep system control.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 15,
    "q": "Which Web application vulnerability results from the application failing to properly validate a user's session, allowing an attacker to steal the session identifier?",
    "opts": ["SQL Injection", "Cross-Site Scripting (XSS)", "Session Hijacking", "Cross-Site Request Forgery (CSRF)"],
    "answer": 2,
    "explain": "Session Hijacking occurs when an attacker steals a valid session ID, often via packet sniffing or XSS, to assume the identity of the authenticated user.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 16,
    "q": "In the Software Development Life Cycle (SDLC), where is security requirement definition and threat modeling typically performed?",
    "opts": ["Coding Phase", "Testing Phase", "Requirements and Design Phase", "Deployment Phase"],
    "answer": 2,
    "explain": "Following the 'Shift Left' security paradigm, security activities like threat modeling and requirement definition should occur as early as possible in the SDLC.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 17,
    "q": "Which term describes the process of systematically evaluating the likelihood and impact of identified threats to organizational assets?",
    "opts": ["Risk Mitigation", "Security Audit", "Risk Assessment", "Compliance Check"],
    "answer": 2,
    "explain": "Risk Assessment is the formal process of identifying assets, threats, vulnerabilities, and determining the potential impact and probability of risk events.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 18,
    "q": "Which attack aims to exhaust the server's connection resources by sending a flood of SYN packets with spoofed source IP addresses?",
    "opts": ["Ping of Death", "Land Attack", "SYN Flood Attack", "Smurf Attack"],
    "answer": 2,
    "explain": "SYN Flood is a classic Denial of Service attack that exploits the TCP three-way handshake by leaving many connections in a half-open state.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 19,
    "q": "What is the most effective defense mechanism against a Cross-Site Request Forgery (CSRF) attack?",
    "opts": ["Input Validation", "Output Encoding", "Anti-CSRF Tokens", "Web Application Firewall (WAF)"],
    "answer": 2,
    "explain": "Anti-CSRF Tokens (synchronizer tokens) are unique, secret, and unpredictable values generated by the server and included in every state-changing request to verify its legitimacy.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 20,
    "q": "Which type of physical access control system relies on a user's unique biological characteristics for authentication?",
    "opts": ["Smart Cards", "Tokens", "Biometrics", "Passwords"],
    "answer": 2,
    "explain": "Biometrics (e.g., fingerprint, retina, voice) are authentication factors based on 'Something You Are'.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 21,
    "q": "Which security measure is specifically designed to detect and block Web application attacks like SQL Injection and XSS by analyzing HTTP traffic?",
    "opts": ["Intrusion Detection System (IDS)", "Network Firewall", "Web Application Firewall (WAF)", "Proxy Server"],
    "answer": 2,
    "explain": "A WAF (Web Application Firewall) operates at the Application Layer (Layer 7) and provides dedicated protection against common Web application exploits.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 22,
    "q": "What is the primary function of a Security Information and Event Management (SIEM) system?",
    "opts": ["Block malicious network traffic in real-time", "Encrypt all data at rest", "Centralize security log collection, correlation, and analysis", "Automate operating system patching"],
    "answer": 2,
    "explain": "A SIEM system is designed to aggregate and analyze security-related data from various sources to provide real-time threat detection and compliance reporting.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 23,
    "q": "Which concept in cryptography states that a small change in the plaintext should result in a large, unpredictable change in the ciphertext?",
    "opts": ["One-Way Property", "Confusion", "Diffusion", "Key Clustering"],
    "answer": 2,
    "explain": "Diffusion aims to spread the influence of a single plaintext digit over many ciphertext digits to mask statistical properties of the plaintext.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 24,
    "q": "What is the primary characteristic that distinguishes a worm from a virus?",
    "opts": ["A worm requires a host file to execute", "A worm cannot infect a computer without user interaction", "A worm is self-replicating and self-propagating without a host file", "A worm is always designed for financial gain"],
    "answer": 2,
    "explain": "Worms are self-contained, self-replicating malware that can spread independently across networks without needing to attach to a host file or program.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 25,
    "q": "In the context of the CIA Triad, which goal is primarily concerned with protecting data from unauthorized alteration or destruction?",
    "opts": ["Confidentiality", "Availability", "Integrity", "Non-Repudiation"],
    "answer": 2,
    "explain": "Integrity ensures that data is accurate, complete, and protected against unauthorized modification or destruction throughout its lifecycle.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 26,
    "q": "Which standard defines a set of security and privacy controls for U.S. federal information systems and organizations?",
    "opts": ["ISO/IEC 27001", "PCI DSS", "NIST SP 800-53", "HIPAA"],
    "answer": 2,
    "explain": "NIST SP 800-53 provides a catalog of security and privacy controls for federal information systems and organizations to manage risk.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 27,
    "q": "Which protocol uses tickets to grant users access to services on a network, minimizing the need for repeated authentication (Single Sign-On)?",
    "opts": ["SAML", "OAuth", "Kerberos", "LDAP"],
    "answer": 2,
    "explain": "Kerberos is a network authentication protocol that works based on tickets to prove a user's identity to network services, enabling SSO.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 28,
    "q": "What is the most volatile type of digital evidence that should be collected first during a digital forensic investigation?",
    "opts": ["Hard Disk Drive (HDD) image", "System Logs", "System Memory (RAM) contents", "Router Configuration Files"],
    "answer": 2,
    "explain": "System memory (RAM) is the most volatile, as its contents are lost immediately upon system shutdown or power loss, making it the highest priority for collection.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 29,
    "q": "Which type of control is designed to fix the conditions that led to a security breach, such as re-imaging a compromised system or updating a firewall rule?",
    "opts": ["Preventive Control", "Detective Control", "Corrective Control", "Compensating Control"],
    "answer": 2,
    "explain": "Corrective controls are implemented to remedy the circumstances that allowed a security incident to occur, or to restore systems to a secure state.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 30,
    "q": "The concept of 'Chain of Custody' in digital forensics primarily ensures which aspect of the evidence?",
    "opts": ["Confidentiality", "Availability", "Integrity and Authenticity", "Non-Repudiation"],
    "answer": 2,
    "explain": "Chain of Custody is a process that documents the chronological control, transfer, and disposition of evidence to ensure its integrity and authenticity in court.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 31,
    "q": "In Cloud Computing (SaaS model), which security aspect is the **customer's** primary responsibility?",
    "opts": ["Physical data center security", "Virtualization layer security", "Data and User Access Management", "Operating System patching"],
    "answer": 2,
    "explain": "In the SaaS model, the cloud provider manages almost everything, leaving the customer primarily responsible for their data classification and user access control.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 32,
    "q": "Which type of application attack exploits improper handling of path separators (e.g., `../`) to access files outside the intended web root directory?",
    "opts": ["SQL Injection", "XSS", "Directory Traversal", "File Inclusion"],
    "answer": 2,
    "explain": "Directory Traversal (or Path Traversal) allows an attacker to read arbitrary files on the system outside the application's intended file access path.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 33,
    "q": "Which term describes the practice of creating fake systems or environments to attract and observe attackers to gather threat intelligence?",
    "opts": ["Sandboxing", "Intrusion Detection System (IDS)", "Honeypot", "Deception Technology"],
    "answer": 2,
    "explain": "A Honeypot is a security resource whose sole purpose is to be probed, attacked, or compromised, thereby diverting attackers from real systems and providing intelligence.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 34,
    "q": "Which symmetric cipher mode is commonly used for disk encryption and transforms a block cipher into a stream cipher by feeding the output back as input?",
    "opts": ["ECB (Electronic Codebook)", "CBC (Cipher Block Chaining)", "CTR (Counter Mode)", "GCM (Galois/Counter Mode)"],
    "answer": 2,
    "explain": "CTR (Counter Mode) transforms a block cipher into a stream cipher, enabling parallel processing and often used for high-performance data encryption, including disk encryption.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 35,
    "q": "What is the primary purpose of requiring developers to use parameterized queries (Prepared Statements)?",
    "opts": ["Prevent Cross-Site Scripting (XSS)", "Prevent Cross-Site Request Forgery (CSRF)", "Prevent SQL Injection attacks", "Prevent Buffer Overflows"],
    "answer": 2,
    "explain": "Parameterized queries separate the SQL command structure from the user-supplied data, ensuring input is treated as data, not executable code, thus preventing SQL Injection.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 36,
    "q": "In Business Continuity Planning (BCP), which term defines the maximum tolerable period for which data might be lost from an IT service due to a major incident?",
    "opts": ["RTO (Recovery Time Objective)", "MTTR (Mean Time to Repair)", "RPO (Recovery Point Objective)", "MTBF (Mean Time Between Failures)"],
    "answer": 2,
    "explain": "RPO (Recovery Point Objective) specifies the age of files or data that must be recovered from backup storage for normal operations to resume after a failure.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 37,
    "q": "Which cryptographic property of a hash function ensures that it is computationally infeasible to find a second input that hashes to the same output as a given input?",
    "opts": ["Avalanche Effect", "Pre-image Resistance (One-Way)", "Second Pre-image Resistance (Weak Collision)", "Collision Resistance (Strong Collision)"],
    "answer": 2,
    "explain": "Second Pre-image Resistance (Weak Collision Resistance) means it is difficult to find a different input that produces the same hash as a pre-existing input.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 38,
    "q": "Which network attack involves an attacker sending unsolicited ARP replies to poison the ARP caches of other devices on the local network segment?",
    "opts": ["DNS Spoofing", "SYN Flood", "ARP Spoofing/Poisoning", "Man-in-the-Middle (MITM)"],
    "answer": 2,
    "explain": "ARP Spoofing/Poisoning exploits the stateless nature of the ARP protocol to map the attacker's MAC address to a legitimate IP address, often leading to MITM attacks.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 39,
    "q": "Which principle in physical security ensures that no single person should be able to complete a critical or high-risk task alone?",
    "opts": ["Least Privilege", "Need-to-Know", "Separation of Duties (SoD)", "Job Rotation"],
    "answer": 2,
    "explain": "Separation of Duties (SoD) requires that two or more people are needed to complete a critical task, preventing fraud and error.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 40,
    "q": "What is the primary function of the Initialization Vector (IV) in symmetric block ciphers like AES in CBC mode?",
    "opts": ["Increase the key length", "Provide non-repudiation", "Ensure identical plaintexts produce different ciphertexts", "Speed up the encryption process"],
    "answer": 2,
    "explain": "The IV is a random or pseudorandom block used to introduce randomness into the encryption process, ensuring that the same plaintext encrypted multiple times yields different ciphertexts.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 41,
    "q": "Which standard focuses on establishing, implementing, maintaining, and continually improving an Information Security Management System (ISMS)?",
    "opts": ["NIST SP 800-53", "HIPAA", "ISO/IEC 27001", "PCI DSS"],
    "answer": 2,
    "explain": "ISO/IEC 27001 is the international standard for managing information security, based on a risk assessment and the PDCA (Plan-Do-Check-Act) cycle.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 42,
    "q": "What is the security flaw that occurs when multiple processes try to access and modify the same resource simultaneously, leading to unpredictable results?",
    "opts": ["Buffer Overflow", "Time of Check/Time of Use (TOCTOU)", "Race Condition", "Directory Traversal"],
    "answer": 2,
    "explain": "A Race Condition is a type of TOCTOU (Time of Check/Time of Use) flaw where the outcome depends on the sequence or timing of uncontrollable events.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 43,
    "q": "Which authentication factor is categorized as 'Something You Have'?",
    "opts": ["Password", "Fingerprint", "Smart Card/Token", "PIN Code"],
    "answer": 2,
    "explain": "Smart Cards, USB tokens, or key fobs are physical items possessed by the user, falling into the 'Something You Have' category.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 44,
    "q": "The widely adopted standard for securing email with both digital signatures and encryption is?",
    "opts": ["PGP (Pretty Good Privacy)", "TLS/SSL", "S/MIME (Secure/Multipurpose Internet Mail Extensions)", "IPsec"],
    "answer": 2,
    "explain": "S/MIME is the de facto standard for securing email, providing digital signatures for authentication/integrity/non-repudiation and encryption for confidentiality.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 45,
    "q": "Which attack exploits the failure of an application to properly encode or escape data returned to the user, allowing client-side script execution?",
    "opts": ["SQL Injection", "CSRF", "Cross-Site Scripting (XSS)", "Directory Traversal"],
    "answer": 2,
    "explain": "XSS (Cross-Site Scripting) is a vulnerability where an attacker injects malicious script into a webpage viewed by other users.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 46,
    "q": "In the DevSecOps model, integrating security testing earlier in the pipeline (e.g., using SAST on source code) is known as what principle?",
    "opts": ["Security Automation", "Defense in Depth", "Shift Left", "Continuous Monitoring"],
    "answer": 2,
    "explain": "The 'Shift Left' principle advocates for moving security activities and testing earlier in the Software Development Life Cycle (SDLC).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 47,
    "q": "Which type of control uses fences, locks, alarms, and guards to protect the organization's assets?",
    "opts": ["Administrative Control", "Technical Control", "Physical Control", "Logical Control"],
    "answer": 2,
    "explain": "Physical controls are security measures applied to the physical environment to protect assets from unauthorized physical access or damage.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 48,
    "q": "Which term describes the process of systematically checking a system's configuration against a security baseline or established standard?",
    "opts": ["Penetration Testing", "Vulnerability Assessment", "Security Auditing", "Compliance Monitoring"],
    "answer": 2,
    "explain": "Security Auditing is a systematic and independent examination of a system's configuration, controls, and practices to determine compliance with security policies.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 49,
    "q": "The primary weakness exploited by the 'Birthday Attack' is related to which cryptographic primitive?",
    "opts": ["Symmetric Ciphers", "Asymmetric Ciphers", "Hashing Algorithms", "Key Exchange Protocols"],
    "answer": 2,
    "explain": "The Birthday Attack is a probability method used to find collisions in hashing algorithms, exploiting the mathematical probability that two people in a small group share the same birthday.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 50,
    "q": "In an organizational security structure, the person responsible for defining the security policies and overseeing their implementation at a high level is typically the:",
    "opts": ["System Administrator", "Security Engineer", "Chief Information Security Officer (CISO)", "Data Owner"],
    "answer": 2,
    "explain": "The CISO (Chief Information Security Officer) is the senior executive responsible for the organization's entire information and data security strategy and oversight.",
    "video": "http://www.midkey.xyz"
  },

{
    "id": 51,
    "q": "According to the (ISC)² Code of Ethics, which canon takes absolute precedence over all others when there is a conflict?",
    "opts": ["Protect society, the common good, necessary public trust and confidence, and the infrastructure", "Act honorably, honestly, justly, responsibly, and legally", "Provide diligent and competent service to principals", "Advance and protect the profession"],
    "answer": 3,
    "explain": "The very first canon ('Protect society, the common good...') has priority over the others. All other canons are subordinate to this one.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 52,
    "q": "Which of the following is the BEST example of a technical compensatory control for a lack of separation of duties in a small organization?",
    "opts": ["Mandatory vacation", "Dual authorization in the application", "Detailed audit logging with monthly review by management", "Job rotation"],
    "answer": 3,
    "explain": "Detailed audit logging with mandatory review by an independent party (management) is a technical compensatory control that can partially mitigate the risk when true separation of duties cannot be achieved.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 53,
    "q": "During a Business Impact Analysis (BIA), the Maximum Acceptable Outage (MAO) is most closely related to which term?",
    "opts": ["Recovery Point Objective (RPO)", "Recovery Time Objective (RTO)", "Recovery Capacity Objective (RCapO)", "Maximum Tolerable Downtime (MTD)"],
    "answer": 3,
    "explain": "Maximum Acceptable Outage (MAO) is an older term that is essentially synonymous with Maximum Tolerable Downtime (MTD), which directly informs the Recovery Time Objective (RTO).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 54,
    "q": "In mandatory access control (MAC) using the Bell-LaPadula model, which security rule prevents a subject at a lower security level from writing data to a higher security level?",
    "opts": ["Simple Security Property (no read up)", "*-Property (Star Property, no write down)", "Strong *-Property", "No write up rule"],
    "answer": 3,
    "explain": "Bell-LaPadula is focused on confidentiality. The rule that prevents writing up to a higher level is actually called the 'no write up' rule, but it is not one of the formally named properties. The formally named *-Property prevents writing down.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 55,
    "q": "Which of the following cryptographic attacks has been practically demonstrated against MD5 and is based on finding two different messages with the same hash value?",
    "opts": ["Preimage attack", "Second preimage attack", "Collision attack", "Length extension attack"],
    "answer": 3,
    "explain": "A collision attack finds any two different messages (M1 ≠ M2) that produce the same hash value. Practical collisions have been found in MD5 since 2004.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 56,
    "q": "In the Common Criteria (ISO/IEC 15408), what is the name of the document that defines a set of security functional and assurance requirements for a specific category of products?",
    "opts": ["Security Target (ST)", "Target of Evaluation (TOE)", "Protection Profile (PP)", "Evaluation Assurance Level (EAL)"],
    "answer": 3,
    "explain": "A Protection Profile (PP) is a vendor-neutral document that defines security requirements for an entire class of products (e.g., firewalls, IDS).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 57,
    "q": "Which type of access control is most commonly implemented using Access Control Lists (ACLs) on routers and firewalls?",
    "opts": ["Role-Based Access Control (RBAC)", "Mandatory Access Control (MAC)", "Discretionary Access Control (DAC)", "Attribute-Based Access Control (ABAC)"],
    "answer": 3,
    "explain": "ACLs allow the resource owner (or administrator) to define who can access the resource and what operations are permitted—classic Discretionary Access Control (DAC).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 58,
    "q": "The Clark-Wilson integrity model primarily enforces which two key principles?",
    "opts": ["Simple Integrity and *-Property", "Well-formed transactions and separation of duties", "Tranquility and confinement", "Least privilege and need-to-know"],
    "answer": 3,
    "explain": "Clark-Wilson is a commercial integrity model built around well-formed transactions (controlled data changes) and separation of duties.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 59,
    "q": "Which regulation specifically requires organizations to maintain an inventory of all systems that process credit card data and to regularly test security systems and processes?",
    "opts": ["HIPAA Security Rule", "GDPR", "PCI DSS", "SOX"],
    "answer": 3,
    "explain": "PCI DSS Requirement 11 explicitly requires maintaining an inventory of system components and regular testing (vulnerability scans, penetration testing).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 60,
    "q": "In a Biba integrity model, which property prevents a subject at a lower integrity level from writing to a higher integrity level?",
    "opts": ["Simple Integrity Property (no read down)", "Integrity *-Property (no write up)", "Invocation Property", "Strong Integrity Property"],
    "answer": 3,
    "explain": "The Integrity *-Property (no write up) ensures that a subject cannot write data to an object of higher integrity, preventing contamination of high-integrity data.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 61,
    "q": "Which of the following is the most important reason to perform regular penetration testing?",
    "opts": ["To satisfy audit requirements", "To find vulnerabilities that automated scanners miss", "To validate that security controls are operating effectively from an attacker’s perspective", "To generate detailed vulnerability reports"],
    "answer": 3,
    "explain": "Penetration testing simulates real-world attacks to validate whether existing controls can actually prevent exploitation, not just whether vulnerabilities exist.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 62,
    "q": "Which term describes an attack where the attacker secretly relays and possibly alters communication between two parties who believe they are directly communicating with each other?",
    "opts": ["Replay attack", "Session hijacking", "Man-in-the-middle (MITM)", "On-path attack"],
    "answer": 3,
    "explain": "Man-in-the-middle (MITM) is the classic term for intercepting and potentially modifying communication between two parties.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 63,
    "q": "According to NIST SP 800-61 (Computer Security Incident Handling Guide), which incident response phase involves collecting evidence, performing forensic analysis, and documenting findings?",
    "opts": ["Preparation", "Detection and Analysis", "Containment, Eradication, and Recovery", "Post-Incident Activity"],
    "answer": 3,
    "explain": "Containment, Eradication, and Recovery phase includes forensic preservation, evidence gathering, and detailed analysis to understand the incident.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 64,
    "q": "Which of the following is a key characteristic of a Type 1 (hardware) Hypervisor?",
    "opts": ["It runs as an application on top of a host OS", "It requires a host operating system to function", "It runs directly on the physical hardware with no host OS", "It is less secure than Type 2"],
    "answer": 3,
    "explain": "Type 1 (bare-metal) hypervisors (e.g., VMware ESXi, Microsoft Hyper-V in bare-metal mode, Xen) run directly on hardware without a host OS.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 65,
    "q": "The principle that requires evidence to be collected in a manner that does not alter the original data is known as:",
    "opts": ["Chain of custody", "Order of volatility", "Write-blocker usage", "Data integrity preservation"],
    "answer": 3,
    "explain": "Using a write-blocker ensures that the forensic acquisition process does not modify the source evidence.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 66,
    "q": "Which access control model uses security labels and requires both classification and category matching for access?",
    "opts": ["RBAC", "DAC", "MAC with categories (lattice)", "ABAC"],
    "answer": 3,
    "explain": "Mandatory Access Control using a lattice model (e.g., military classification + compartments/categories) requires both level and category set inclusion.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 67,
    "q": "In the context of digital signatures, which key is used to verify the signature?",
    "opts": ["Recipient’s private key", "Sender’s private key", "Sender’s public key", "Certificate Authority’s private key"],
    "answer": 3,
    "explain": "The sender signs with their private key; anyone can verify the signature using the sender’s public key (usually obtained from a certificate).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 68,
    "q": "Which of the following is the primary purpose of a Certificate Revocation List (CRL)?",
    "opts": ["To publish new certificates", "To store certificate fingerprints", "To inform relying parties that certain certificates are no longer trusted", "To extend certificate validity"],
    "answer": 3,
    "explain": "A CRL is a list published by the CA containing serial numbers of certificates that have been revoked before their expiration date.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 69,
    "q": "Which security architecture framework is based on the concepts of Zero Trust and assumes no implicit trust regardless of location?",
    "opts": ["SABSA", "TOGAF", "Zero Trust Architecture (ZTA)", "Sherwood Applied Business Security Architecture"],
    "answer": 3,
    "explain": "Zero Trust Architecture, popularized by NIST SP 800-207, operates on the principle of 'never trust, always verify'.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 70,
    "q": "In software testing, which type of tool analyzes source code without executing it to find potential security flaws?",
    "opts": ["Dynamic Application Security Testing (DAST)", "Interactive Application Security Testing (IAST)", "Static Application Security Testing (SAST)", "Runtime Application Self-Protection (RASP)"],
    "answer": 3,
    "explain": "SAST performs static analysis on source code or binaries without running the program.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 71,
    "q": "Which of the following is considered a directive control?",
    "opts": ["Firewall rule", "Security guard", "Security policy", "Encryption"],
    "answer": 3,
    "explain": "Security policies, standards, and procedures are directive (administrative) controls that tell people what they should do.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 72,
    "q": "The OWASP Top 10 category 'A03:2021-Injection' primarily includes which classic attack?",
    "opts": ["Cross-Site Scripting (XSS)", "LDAP Injection", "Broken Authentication", "Security Misconfiguration"],
    "answer": 3,
    "explain": "Injection flaws, including SQL, NoSQL, OS command, and LDAP injection, fall under this category.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 73,
    "q": "Which encryption mode is vulnerable to bit-flipping attacks because each block is encrypted independently?",
    "opts": ["CBC (Cipher Block Chaining)", "CFB (Cipher Feedback)", "ECB (Electronic Codebook)", "GCM (Galois/Counter Mode)"],
    "answer": 3,
    "explain": "ECB mode encrypts each block independently, making patterns visible and allowing block swapping or flipping without detection.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 74,
    "q": "Who is ultimately responsible for classifying data and determining appropriate protection levels in an organization?",
    "opts": ["Data custodian", "Security administrator", "Data owner", "Chief Information Security Officer (CISO)"],
    "answer": 3,
    "explain": "The data owner (usually a business unit manager) is accountable for classifying data and approving access.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 75,
    "q": "Which of the following is the BEST defense against XML External Entity (XXE) attacks?",
    "opts": ["Input sanitization", "Using JSON instead of XML", "Disabling external entity processing in the XML parser", "Implementing rate limiting"],
    "answer": 3,
    "explain": "The root cause of XXE is the XML parser resolving external entities. Disabling this feature completely eliminates the vulnerability.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 76,
    "q": "In the STRIDE threat modeling framework, which category represents the threat of an attacker gaining higher privileges?",
    "opts": ["Spoofing", "Tampering", "Elevation of Privilege", "Information Disclosure"],
    "answer": 3,
    "explain": "STRIDE: Spoofing, Tampering, Repudiation, Information Disclosure, Denial of Service, Elevation of Privilege.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 77,
    "q": "Which law or regulation in the United States specifically protects the privacy of student education records?",
    "opts": ["HIPAA", "GLBA", "FERPA", "COPPA"],
    "answer": 3,
    "explain": "Family Educational Rights and Privacy Act (FERPA) protects the privacy of student education records.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 78,
    "q": "Which type of fire suppression system is generally considered safe for occupied spaces containing electronic equipment?",
    "opts": ["CO2", "Water sprinkler", "FM-200 (or other clean agent)", "Halon 1301"],
    "answer": 3,
    "explain": "Clean agents like FM-200, Novec 1230, or Inergen suppress fire without leaving residue and are safe for occupied areas.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 79,
    "q": "The principle that requires two individuals to be present during the performance of a sensitive operation is known as:",
    "opts": ["Dual control", "Split knowledge", "Two-person integrity", "Two-man rule"],
    "answer": 3,
    "explain": "Two-person integrity (or two-man rule) requires two authorized people to be physically present and actively participate.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 80,
    "q": "Which protocol is used to securely distribute revocation information in real-time instead of relying on periodic CRL downloads?",
    "opts": ["OCSP (Online Certificate Status Protocol)", "SCVP (Server-based Certificate Validation Protocol)", "XKMS (XML Key Management Specification)", "CMP (Certificate Management Protocol)"],
    "answer": 3,
    "explain": "OCSP provides real-time certificate status (good, revoked, unknown) via an online responder.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 81,
    "q": "Which of the following is an example of a preventive control?",
    "opts": ["Intrusion Detection System (IDS)", "Security awareness training", "Log monitoring", "Incident response plan"],
    "answer": 3,
    "explain": "Security awareness training prevents incidents by educating users to recognize phishing, social engineering, etc.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 82,
    "q": "In the context of identity federation, which standard uses XML to exchange authentication and authorization data between an Identity Provider (IdP) and a Service Provider (SP)?",
    "opts": ["OAuth 2.0", "OpenID Connect", "SAML", "Kerberos"],
    "answer": 3,
    "explain": "Security Assertion Markup Language (SAML) is the XML-based federation standard widely used in enterprise environments.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 83,
    "q": "Which of the following is the primary risk associated with using Electronic Codebook (ECB) mode for block ciphers?",
    "opts": ["It is slower than other modes", "It does not provide integrity", "Identical plaintext blocks produce identical ciphertext blocks", "It requires padding"],
    "answer": 3,
    "explain": "ECB’s deterministic nature leaks patterns in the data (e.g., the famous penguin image encrypted with ECB shows the pattern).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 84,
    "q": "Which role in a public key infrastructure (PKI) is responsible for actually issuing certificates after the RA has verified identity?",
    "opts": ["Registration Authority (RA)", "Validation Authority (VA)", "Certificate Authority (CA)", "Certificate Repository"],
    "answer": 3,
    "explain": "The Certificate Authority (CA) is the entity that cryptographically signs and issues the digital certificate.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 85,
    "q": "Which attack exploits the predictability of an Initialization Vector (IV) in stream ciphers or certain block cipher modes?",
    "opts": ["Birthday attack", "Meet-in-the-middle attack", "IV reuse attack", "Padding oracle attack"],
    "answer": 3,
    "explain": "Reusing the same IV with the same key in modes like CBC or stream ciphers can leak information or allow full plaintext recovery.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 86,
    "q": "The NIST Cybersecurity Framework consists of how many core functions?",
    "opts": ["3", "4", "5", "6"],
    "answer": 3,
    "explain": "The five core functions are: Identify, Protect, Detect, Respond, Recover.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 87,
    "q": "Which of the following is classified as a Type II authentication factor?",
    "opts": ["Password", "Token (something you have)", "Fingerprint", "Voice pattern"],
    "answer": 3,
    "explain": "Something you have (token, smart card) is Type II. Type I = something you know, Type III = something you are.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 88,
    "q": "Which testing methodology assumes the tester has no prior knowledge of the system and simulates a real external attacker?",
    "opts": ["White-box testing", "Gray-box testing", "Black-box testing", "Crystal-box testing"],
    "answer": 3,
    "explain": "Black-box testing provides no internal information—mirroring an external attacker’s perspective.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 89,
    "q": "Which of the following is a primary goal of secure software development training for developers?",
    "opts": ["Teach advanced cryptography", "Reduce the number of vulnerabilities introduced during coding", "Replace the need for penetration testing", "Ensure 100% secure code"],
    "answer": 3,
    "explain": "Developer training aims to prevent common coding mistakes that lead to vulnerabilities (e.g., injection, XSS).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 90,
    "q": "In risk management, the formula 'Risk = Threat × Vulnerability × Impact' is often simplified to:",
    "opts": ["Risk = Likelihood × Consequence", "Risk = Asset Value × Exposure Factor", "Risk = Threat × Control Gap", "Risk = Probability × Severity"],
    "answer": 3,
    "explain": "The most common simplified expression used in CISSP and many frameworks is Risk = Likelihood × Consequence (or Impact).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 91,
    "q": "Which control type is a security awareness training program?",
    "opts": ["Technical", "Physical", "Administrative", "Compensating"],
    "answer": 3,
    "explain": "Awareness training is an administrative (managerial/directive) control.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 92,
    "q": "Which of the following is the strongest form of non-repudiation when sending a message?",
    "opts": ["Encrypting the message with the recipient’s public key", "Hashing the message", "Digitally signing the message with the sender’s private key", "Using a Message Authentication Code (MAC)"],
    "answer": 3,
    "explain": "Only a digital signature using the sender’s private key provides true non-repudiation, because only the sender could have created it.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 93,
    "q": "Which document formally authorizes the creation of an information system and acknowledges the associated risks?",
    "opts": ["System Security Plan (SSP)", "Security Assessment Report (SAR)", "Authorization to Operate (ATO)", "Plan of Action and Milestones (POA&M)"],
    "answer": 3,
    "explain": "The Authorization to Operate (ATO) is the official management decision to authorize operation of an information system based on accepted risk.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 94,
    "q": "Which type of malware is specifically designed to extort money by encrypting victim files and demanding ransom?",
    "opts": ["Spyware", "Adware", "Ransomware", "Logic bomb"],
    "answer": 3,
    "explain": "Ransomware encrypts files and demands payment for the decryption key.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 95,
    "q": "Which of the following is an example of a logical control?",
    "opts": ["Firewall", "Security guard", "Fence", "Mantrap"],
    "answer": 3,
    "explain": "Firewalls are technical/logical controls that enforce policy at the network or application layer.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 96,
    "q": "In the context of secure email, what does OpenPGP primarily provide that S/MIME does not natively support?",
    "opts": ["Web of trust model", "X.509 hierarchical PKI", "Better compression", "Built-in key escrow"],
    "answer": 3,
    "explain": "OpenPGP uses a decentralized web-of-trust model rather than relying on central Certificate Authorities.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 97,
    "q": "Which type of access control is based on the sensitivity (classification) of the information and the clearance of the user?",
    "opts": ["Role-Based Access Control (RBAC)", "Discretionary Access Control (DAC)", "Mandatory Access Control (MAC)", "Rule-Based Access Control"],
    "answer": 3,
    "explain": "MAC uses labels (classification/clearance) enforced by the system, not by object owners.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 98,
    "q": "Which of the following is the primary purpose of salting a password hash?",
    "opts": ["Slow down the hashing process", "Make pre-computed rainbow table attacks ineffective", "Increase entropy of the password", "Prevent brute-force attacks entirely"],
    "answer": 3,
    "explain": "A unique salt per user defeats pre-computed hash tables (rainbow tables).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 99,
    "q": "Which of the following is a key advantage of using AES-GCM over AES-CBC with HMAC?",
    "opts": ["Faster encryption", "Smaller key size", "Authenticated encryption in a single pass (performance + integrity)", "Better resistance to quantum attacks"],
    "answer": 3,
    "explain": "AES-GCM provides both confidentiality and integrity (authenticated encryption) in one cryptographic operation, offering better performance than separate CBC+HMAC.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 100,
    "q": "According to (ISC)², a CISSP must report any unethical or illegal behavior by another CISSP that could harm the profession. This falls under which canon of the Code of Ethics?",
    "opts": ["Protect society, the common good...", "Act honorably, honestly, justly...", "Provide diligent and competent service to principals", "Advance and protect the profession"],
    "answer": 3,
    "explain": "The fourth canon requires CISSPs to advance and protect the profession, which includes reporting violations of the Code of Ethics.",
    "video": "http://www.midkey.xyz"
  },

  {
    "id": 101,
    "q": "Which of the following is the PRIMARY goal of information security governance?",
    "opts": ["To align security strategy with business objectives", "To implement the latest security technologies", "To achieve 100% compliance with all regulations", "To eliminate all security incidents"],
    "answer": 0,
    "explain": "Information security governance ensures that security activities support and enable business objectives and are aligned with organizational strategy.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 102,
    "q": "In the CIA triad, which component is violated when an attacker successfully performs a ransomware attack and encrypts critical files?",
    "opts": ["Availability", "Integrity", "Confidentiality", "Authenticity"],
    "answer": 0,
    "explain": "Ransomware primarily targets Availability by making data and systems inaccessible to legitimate users until ransom is paid or systems are restored.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 103,
    "q": "Which access control model gives the owner of an object full discretion to determine who can access it and what permissions they have?",
    "opts": ["Mandatory Access Control (MAC)", "Role-Based Access Control (RBAC)", "Discretionary Access Control (DAC)", "Rule-Based Access Control (RuBAC)"],
    "answer": 0,
    "explain": "DAC is defined by the owner’s discretion—typical in most commercial operating systems (NTFS permissions, Unix file permissions).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 104,
    "q": "Which of the following is considered the MOST volatile type of evidence in digital forensics?",
    "opts": ["Data on hard disk drives", "Log files on servers", "CPU registers and RAM contents", "Network packet captures stored on disk"],
    "answer": 0,
    "explain": "RAM and CPU registers/cache are lost immediately upon power-off, making them the most volatile according to the order of volatility (RFC 3227).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 105,
    "q": "Which symmetric encryption algorithm is the current U.S. government standard for protecting classified information up to TOP SECRET?",
    "opts": ["3DES", "Blowfish", "AES-256", "Twofish"],
    "answer": 0,
    "explain": "AES-256 is approved by NSA for protecting classified information up to TOP SECRET when implemented in approved modules.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 106,
    "q": "Which risk response strategy involves purchasing cyber insurance to offset potential financial losses?",
    "opts": ["Risk transference", "Risk avoidance", "Risk mitigation", "Risk acceptance"],
    "answer": 0,
    "explain": "Transferring risk via insurance shifts the financial impact to a third party while the organization retains the operational risk.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 107,
    "q": "Which of the following is the FIRST step in the NIST Risk Management Framework (RMF)?",
    "opts": ["Assess security controls", "Categorize the system", "Implement security controls", "Monitor security controls"],
    "answer": 0,
    "explain": "Step 1 of the RMF is Categorize—determine the system’s impact level (Low/Moderate/High) based on FIPS 199.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 108,
    "q": "Which type of fire extinguisher is suitable for use on electrical fires in a data center?",
    "opts": ["Class A (water)", "Class B (CO₂)", "Class C (electrical – typically CO₂ or clean agent)", "Class D (metal fires)"],
    "answer": 0,
    "explain": "Class C fires involve energized electrical equipment. CO₂ and clean agents (Class C-rated) are safe because they leave no residue and do not conduct electricity.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 109,
    "q": "Which cryptographic property ensures that only the holder of the private key can create a digital signature?",
    "opts": ["Non-repudiation", "Integrity", "Confidentiality", "Authentication"],
    "answer": 0,
    "explain": "Non-repudiation is achieved because only the private key holder can produce a valid signature that verifies with the corresponding public key.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 110,
    "q": "Which control category includes policies, standards, and procedures?",
    "opts": ["Technical controls", "Physical controls", "Administrative controls", "Compensating controls"],
    "answer": 0,
    "explain": "Policies, procedures, security awareness training, and background checks are all administrative (also called managerial or directive) controls.",
    "video": "http://www.midkey.xyz"
  },

  {
    "id": 111,
    "q": "Which of the following is the PRIMARY purpose of a Security Operations Center (SOC)?",
    "opts": ["Continuous monitoring and analysis of security events to detect, respond to, and report incidents", "Patch management for all enterprise systems", "Long-term forensic investigations", "Physical security of data centers"],
    "answer": 0,
    "explain": "A SOC’s core mission is real-time monitoring, detection, analysis, and coordinated response to security incidents.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 112,
    "q": "In the Bell-LaPadula confidentiality model, the property that prevents a subject from reading data at a higher classification level is known as:",
    "opts": ["Simple Security Property (no read up)", "*-Property (no write down)", "Strong Star Property", "Tranquility Property"],
    "answer": 0,
    "explain": "The Simple Security Property (ss-property) enforces 'no read up' to protect confidentiality.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 113,
    "q": "Which type of access control is most suitable for dynamic, rapidly changing environments where access decisions depend on multiple attributes (time, location, device posture, etc.)?",
    "opts": ["Attribute-Based Access Control (ABAC)", "Role-Based Access Control (RBAC)", "Mandatory Access Control (MAC)", "Discretionary Access Control (DAC)"],
    "answer": 0,
    "explain": "ABAC uses policies combining subject, object, action, and environmental attributes for fine-grained, context-aware decisions.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 114,
    "q": "Which U.S. law requires federal agencies to develop, document, and implement an agency-wide information security program?",
    "opts": ["FISMA (Federal Information Security Modernization Act)", "HIPAA", "Sarbanes-Oxley Act (SOX)", "Gramm-Leach-Bliley Act (GLBA)"],
    "answer": 0,
    "explain": "FISMA mandates that all federal agencies establish comprehensive information security programs and report annually.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 115,
    "q": "Which of the following is the MOST effective countermeasure against shoulder surfing attacks?",
    "opts": ["Privacy screen filters on monitors and devices", "Strong password complexity", "Multi-factor authentication", "Security awareness training only"],
    "answer": 0,
    "explain": "Privacy filters physically prevent viewing the screen from side angles, directly mitigating shoulder surfing.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 116,
    "q": "Which key management practice is considered the gold standard for protecting cryptographic keys at rest?",
    "opts": ["Hardware Security Module (HSM)", "Encrypted database storage", "OS file permissions", "Cloud KMS with default settings"],
    "answer": 0,
    "explain": "HSMs are tamper-resistant hardware devices specifically designed to generate, store, and manage cryptographic keys securely.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 117,
    "q": "Which phase of the incident response lifecycle involves preserving evidence and documenting the timeline of events?",
    "opts": ["Preparation", "Identification", "Containment", "Eradication"],
    "answer": 0,
    "explain": "Preparation includes establishing processes, tools, and evidence-handling procedures before an incident occurs.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 118,
    "q": "Which of the following is the MOST common cause of security incidents according to multiple industry reports?",
    "opts": ["Human error and negligence", "Zero-day exploits", "Advanced Persistent Threats (APTs)", "Insider threats with malicious intent"],
    "answer": 0,
    "explain": "Human error (misconfiguration, phishing, weak passwords, etc.) consistently ranks as the #1 root cause in Verizon DBIR, IBM Cost of Data Breach, etc.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 119,
    "q": "Which control is specifically designed to reduce the likelihood of a single point of failure in authentication?",
    "opts": ["Multi-factor authentication (MFA)", "Single Sign-On (SSO)", "Password complexity", "Account lockout after failed attempts"],
    "answer": 0,
    "explain": "MFA requires multiple independent factors, preventing compromise if one factor (e.g., password) is stolen.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 120,
    "q": "Which of the following is the PRIMARY advantage of using a virtual private network (VPN)?",
    "opts": ["Creates an encrypted tunnel protecting data confidentiality and integrity over untrusted networks", "Increases internet bandwidth", "Hides the user’s public IP address only", "Bypasses content filtering"],
    "answer": 0,
    "explain": "The core purpose of a VPN is to establish a secure, encrypted tunnel across public networks.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 121,
    "q": "Which term describes an attack where the attacker secretly relays and possibly alters communication between two parties?",
    "opts": ["Man-in-the-middle (MITM)", "Man-in-the-browser", "Replay attack", "Session hijacking"],
    "answer": 0,
    "explain": "MITM is the classic definition of intercepting and potentially modifying communication between two parties.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 122,
    "q": "Which NIST publication provides the definitive catalog of security and privacy controls for U.S. federal information systems?",
    "opts": ["NIST SP 800-53", "NIST SP 800-37", "NIST SP 800-61", "NIST SP 800-171"],
    "answer": 0,
    "explain": "SP 800-53 contains the full control catalog used by federal agencies and widely adopted in private sector.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 123,
    "q": "Which type of backup provides the fastest recovery time because it contains a complete, bootable copy of the system?",
    "opts": ["Image-level backup", "Differential backup", "Incremental backup", "File-level backup"],
    "answer": 0,
    "explain": "Image backups (bare-metal) capture the entire system state and allow restoration without reinstalling OS.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 124,
    "q": "Which security principle requires that a user be given no more access than necessary to perform their job?",
    "opts": ["Least privilege", "Need-to-know", "Separation of duties", "Defense in depth"],
    "answer": 0,
    "explain": "Least privilege is the foundational principle limiting permissions to the minimum required.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 125,
    "q": "Which protocol provides secure remote command-line access and is the recommended replacement for Telnet?",
    "opts": ["SSH (Secure Shell)", "RDP", "VNC", "HTTPS"],
    "answer": 0,
    "explain": "SSH encrypts the entire session, replacing clear-text protocols like Telnet and rlogin.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 126,
    "q": "Which cloud service model gives the customer the MOST responsibility for implementing security controls?",
    "opts": ["IaaS (Infrastructure as a Service)", "PaaS", "SaaS", "FaaS"],
    "answer": 0,
    "explain": "In IaaS, the customer manages everything from the OS upward, including patching, access control, and encryption.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 127,
    "q": "Which of the following is the PRIMARY purpose of penetration testing?",
    "opts": ["To validate that security controls are effective against real-world attacks", "To achieve compliance checkboxes", "To find as many vulnerabilities as possible", "To replace vulnerability scanning"],
    "answer": 0,
    "explain": "Pen testing simulates attacker techniques to prove whether controls can actually be bypassed.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 128,
    "q": "Which encryption algorithm is used in Bitcoin for digital signatures?",
    "opts": ["ECDSA (Elliptic Curve Digital Signature Algorithm)", "RSA", "DSA", "EdDSA"],
    "answer": 0,
    "explain": "Bitcoin uses ECDSA with the secp256k1 curve for transaction signing.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 129,
    "q": "Which OWASP Top 10 (2021) risk category includes broken access control issues such as missing authorization checks?",
    "opts": ["A01:2021 – Broken Access Control", "A02:2021 – Cryptographic Failures", "A05:2021 – Security Misconfiguration", "A07:2021 – Identification and Authentication Failures"],
    "answer": 0,
    "explain": "Broken Access Control jumped to #1 in 2021 and covers missing or ineffective authorization enforcement.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 130,
    "q": "Which of the following is the STRONGEST authentication factor?",
    "opts": ["Something you are (biometric)", "Something you know", "Something you have", "Somewhere you are"],
    "answer": 0,
    "explain": "Biometrics ('something you are') are generally considered hardest to forge or steal compared to knowledge or possession factors.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 131,
    "q": "Which document defines the security controls that must be in place before a system can be authorized to operate in a federal agency?",
    "opts": ["System Security Plan (SSP)", "Security Assessment Report (SAR)", "Plan of Action and Milestones (POA&M)", "Risk Assessment Report"],
    "answer": 0,
    "explain": "The SSP documents the selected controls and how they are implemented for the system.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 132,
    "q": "Which type of wireless network attack involves setting up a rogue access point with the same SSID as a legitimate one?",
    "opts": ["Evil twin attack", "WPS attack", "KRACK attack", "Bluejacking"],
    "answer": 0,
    "explain": "Evil twin APs trick users into connecting to the attacker’s network instead of the legitimate one.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 133,
    "q": "Which control is most effective against social engineering attacks?",
    "opts": ["Ongoing security awareness training", "Strong passwords", "Firewall rules", "Intrusion Prevention System"],
    "answer": 0,
    "explain": "Well-trained employees are the strongest defense against phishing, vishing, and impersonation.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 134,
    "q": "Which standard is the international framework for establishing and maintaining an Information Security Management System (ISMS)?",
    "opts": ["ISO/IEC 27001", "ISO/IEC 27002", "NIST CSF", "COBIT"],
    "answer": 0,
    "explain": "ISO 27001 is the certifiable standard that specifies requirements for an ISMS.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 135,
    "q": "Which term describes the maximum amount of data loss an organization can tolerate?",
    "opts": ["Recovery Point Objective (RPO)", "Recovery Time Objective (RTO)", "Maximum Tolerable Downtime (MTD)", "Work Recovery Time (WRT)"],
    "answer": 0,
    "explain": "RPO defines acceptable data loss measured in time (e.g., 4 hours means backups at least every 4 hours).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 136,
    "q": "Which attack exploits trust relationships by using a compromised internal system to attack other internal systems?",
    "opts": ["Pivoting", "Island hopping", "Waterholing", "Spear phishing"],
    "answer": 0,
    "explain": "Pivoting (or lateral movement) is the technique of moving from one compromised host to others inside the network.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 137,
    "q": "Which of the following is a primary goal of secure coding practices?",
    "opts": ["Reduce the number and severity of vulnerabilities in software", "Make code run faster", "Reduce lines of code", "Ensure backward compatibility"],
    "answer": 0,
    "explain": "Secure coding aims to eliminate common flaws (injection, XSS, buffer overflows, etc.) from the start.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 138,
    "q": "Which cryptographic hash function is currently recommended by NIST for most new applications?",
    "opts": ["SHA-3 (or SHAKE variants)", "SHA-1", "MD5", "SHA-256"],
    "answer": 0,
    "explain": "SHA-3 (Keccak) was selected in 2015 as the newest standard and is the future-proof choice.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 139,
    "q": "Which type of disaster recovery site provides fully configured equipment ready for immediate use but without live data?",
    "opts": ["Hot site", "Warm site", "Cold site", "Mobile site"],
    "answer": 0,
    "explain": "Hot sites have real-time or near-real-time data replication and can fail over within minutes.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 140,
    "q": "Which of the following is the BEST definition of a vulnerability?",
    "opts": ["A weakness in a system that can be exploited by a threat", "The likelihood of a threat occurring", "The impact of a successful exploit", "An active attack in progress"],
    "answer": 0,
    "explain": "Vulnerability = weakness; Threat = actor or event that can exploit it; Risk = likelihood × impact.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 141,
    "q": "Which protocol is used to synchronize time accurately across networks and is critical for certificate validation and logging?",
    "opts": ["NTP (Network Time Protocol) with authentication", "SNMP", "ICMP", "DNS"],
    "answer": 0,
    "explain": "Accurate time via authenticated NTP prevents certificate errors and ensures reliable log correlation.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 142,
    "q": "Which of the following is the PRIMARY benefit of implementing role-based access control (RBAC)?",
    "opts": ["Simplifies administration by assigning permissions to roles instead of individuals", "Provides the most granular access possible", "Eliminates the need for auditing", "Works best in small organizations"],
    "answer": 0,
    "explain": "RBAC greatly reduces administrative overhead in large environments by managing permissions at the role level.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 143,
    "q": "Which testing methodology gives the tester full knowledge of the internal structure and source code?",
    "opts": ["White-box testing", "Black-box testing", "Gray-box testing", "Red-team testing"],
    "answer": 0,
    "explain": "White-box (also called clear-box or glass-box) provides complete internal visibility.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 144,
    "q": "Which of the following is the MOST important reason to encrypt data at rest in cloud storage?",
    "opts": ["Protect against insider threats at the cloud provider", "Improve performance", "Reduce storage costs", "Comply with export regulations only"],
    "answer": 0,
    "explain": "Encryption at rest protects data if physical media is compromised or if privileged insiders attempt unauthorized access.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 145,
    "q": "Which attack involves overwhelming a target with traffic from multiple compromised systems?",
    "opts": ["Distributed Denial of Service (DDoS)", "Direct Denial of Service (DoS)", "Smurf attack", "SYN flood"],
    "answer": 0,
    "explain": "DDoS uses a botnet of many systems to amplify the attack volume.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 146,
    "q": "Which of the following is the PRIMARY purpose of a data classification policy?",
    "opts": ["To determine appropriate protection levels based on sensitivity and criticality", "To reduce storage costs", "To simplify user access", "To meet minimum legal requirements only"],
    "answer": 0,
    "explain": "Classification drives handling, marking, storage, and destruction requirements.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 147,
    "q": "Which control would be MOST effective at preventing unauthorized physical access to server rooms?",
    "opts": ["Biometric access controls combined with mantraps", "Simple key locks", "Security guards only", "CCTV cameras"],
    "answer": 0,
    "explain": "Biometrics + mantraps provide strong authentication and prevent tailgating.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 148,
    "q": "Which of the following is the BEST example of separation of duties?",
    "opts": ["One person requests a purchase, another approves it, and a third issues payment", "One administrator handles both backups and restores", "Developers also deploy their own code", "The same team manages firewalls and IDS"],
    "answer": 0,
    "explain": "Classic financial SoD requires different individuals for request, approval, and execution.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 149,
    "q": "Which NIST Cybersecurity Framework core function involves developing and implementing safeguards to limit or contain the impact of a potential cybersecurity event?",
    "opts": ["Protect", "Identify", "Detect", "Respond"],
    "answer": 0,
    "explain": "The Protect function includes access control, awareness training, data security, and maintenance.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 150,
    "q": "Which of the following is the PRIMARY reason organizations implement intrusion detection systems (IDS)?",
    "opts": ["To detect malicious activity that has bypassed preventive controls", "To block all malicious traffic automatically", "To replace firewalls", "To perform vulnerability scanning"],
    "answer": 0,
    "explain": "IDS is a detective control focused on identifying attacks and policy violations in progress.",
    "video": "http://www.midkey.xyz"
  },


  {
    "id": 151,
    "q": "Which of the following is the PRIMARY purpose of conducting tabletop exercises in business continuity planning?",
    "opts": ["To test technical recovery procedures", "To validate and improve the written BCP/DRP by walking through scenarios with key stakeholders", "To achieve full system failover", "To train junior staff on backup software"],
    "answer": 1,
    "explain": "Tabletop exercises are discussion-based sessions that validate the plan, identify gaps, and improve coordination without actual technical recovery.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 152,
    "q": "Which cryptographic attack is specifically mitigated by using unique salts for each user’s password hash?",
    "opts": ["Brute-force attack", "Rainbow table attack", "Dictionary attack", "Birthday attack"],
    "answer": 1,
    "explain": "Unique salts make pre-computed rainbow tables useless because every user has a different salt.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 153,
    "q": "In the context of identity and access management, which protocol is designed for web-based single sign-on using short-lived bearer tokens?",
    "opts": ["SAML 2.0", "OAuth 2.0 + OpenID Connect", "Kerberos", "RADIUS"],
    "answer": 1,
    "explain": "OAuth 2.0 (authorization) combined with OpenID Connect (authentication) is the modern standard for web and mobile SSO using tokens.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 154,
    "q": "Which type of vulnerability is most commonly exploited by SQL injection attacks?",
    "opts": ["Buffer overflow", "Improper input validation / lack of parameterized queries", "Race condition", "Insecure direct object reference"],
    "answer": 1,
    "explain": "SQLi occurs when user input is concatenated directly into SQL queries instead of using prepared statements or parameterized queries.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 155,
    "q": "Which control is considered the MOST effective against phishing attacks?",
    "opts": ["Web filtering", "Ongoing security awareness training and simulated phishing campaigns", "Strong passwords", "Email encryption"],
    "answer": 1,
    "explain": "Well-trained users who recognize phishing attempts remain the strongest defense; technical controls alone are insufficient.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 156,
    "q": "Which of the following is the BEST definition of a zero-day exploit?",
    "opts": ["An attack that occurs on the day a patch is released", "An exploit for a vulnerability that is unknown to the vendor or for which no patch exists", "An attack using open-source tools", "A vulnerability with CVSS score of 0"],
    "answer": 1,
    "explain": "Zero-day means the vendor has zero days to fix it because they are unaware of the flaw when it is first exploited.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 157,
    "q": "Which NIST SP 800 series publication provides guidance on incident handling and response?",
    "opts": ["SP 800-53", "SP 800-61", "SP 800-37", "SP 800-171"],
    "answer": 1,
    "explain": "NIST SP 800-61 Rev. 2 is the Computer Security Incident Handling Guide.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 158,
    "q": "Which encryption mode requires an Initialization Vector (IV) and is vulnerable if the same IV and key are reused?",
    "opts": ["ECB", "CBC (Cipher Block Chaining)", "OFB", "GCM"],
    "answer": 1,
    "explain": "CBC mode XORs each plaintext block with the previous ciphertext; reusing IV+key makes it insecure and can leak plaintext.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 159,
    "q": "Which regulation applies to organizations that process payment card data and requires 12 major requirements grouped into 6 control objectives?",
    "opts": ["HIPAA", "PCI DSS", "GDPR", "SOX"],
    "answer": 1,
    "explain": "PCI DSS (Payment Card Industry Data Security Standard) is mandatory for any entity that stores, processes, or transmits cardholder data.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 160,
    "q": "Which of the following is the PRIMARY benefit of implementing network segmentation?",
    "opts": ["Improved performance", "Limits the scope of compromise and lateral movement by attackers", "Reduced cabling costs", "Easier IP address management"],
    "answer": 1,
    "explain": "Segmentation (especially with firewalls or zero-trust) contains breaches and prevents east-west movement.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 161,
    "q": "Which type of malware is specifically designed to hide its presence and often modifies the operating system kernel?",
    "opts": ["Virus", "Rootkit", "Spyware", "Ransomware"],
    "answer": 1,
    "explain": "Rootkits operate at ring 0 (kernel mode) to conceal processes, files, and network connections.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 162,
    "q": "Which of the following is the MOST important reason to perform regular vulnerability scanning?",
    "opts": ["To achieve compliance", "To identify known vulnerabilities in systems before attackers exploit them", "To replace penetration testing", "To generate pretty reports"],
    "answer": 1,
    "explain": "Proactive identification of known weaknesses allows patching before exploitation.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 163,
    "q": "Which access control model is enforced by the operating system and cannot be changed by regular users?",
    "opts": ["DAC", "MAC (Mandatory Access Control)", "RBAC", "ABAC"],
    "answer": 1,
    "explain": "In MAC, the system (not the owner) enforces access based on security labels (e.g., SELinux, Trusted Solaris).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 164,
    "q": "Which of the following is the BEST example of a corrective control?",
    "opts": ["Firewall", "Patch management and system hardening after a breach", "Intrusion detection system", "Security awareness training"],
    "answer": 1,
    "explain": "Corrective controls fix the problem after an incident (e.g., patching, re-imaging, restoring from backup).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 165,
    "q": "Which protocol is vulnerable to downgrade attacks if not properly configured with proper cipher suite negotiation?",
    "opts": ["IPsec", "TLS/SSL", "SSHv1", "Kerberos"],
    "answer": 1,
    "explain": "TLS downgrade attacks force the client/server to use weaker protocols or ciphers (e.g., forcing TLS 1.0 or SSLv3).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 166,
    "q": "Which term describes a supply-chain attack where malicious code is inserted into legitimate software before distribution?",
    "opts": ["Watering hole", "Software supply-chain compromise (e.g., SolarWinds, CodeCov)", "Island hopping", "Living off the land"],
    "answer": 1,
    "explain": "High-profile examples include SolarWinds Orion (2020), XZ Utils backdoor (2024), and 3CX compromise.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 167,
    "q": "Which of the following is the PRIMARY purpose of a Web Application Firewall (WAF)?",
    "opts": ["To cache web content", "To protect web applications by filtering and monitoring HTTP traffic", "To accelerate web performance", "To terminate SSL connections only"],
    "answer": 1,
    "explain": "WAFs inspect Layer 7 traffic and block common web attacks (SQLi, XSS, etc.).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 168,
    "q": "Which risk assessment methodology uses Delphi technique, workshops, and scoring (1-5) for likelihood and impact?",
    "opts": ["Quantitative (ALE/SLE)", "Qualitative risk assessment", "OCTAVE", "FAIR"],
    "answer": 1,
    "explain": "Qualitative assessment uses subjective scales (Low/Medium/High or 1-5) and is the most common in practice.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 169,
    "q": "Which of the following is the STRONGEST form of authentication when combining factors?",
    "opts": ["Password + SMS OTP", "Password + hardware token + biometrics (three factors)", "Password + security question", "PIN + smart card"],
    "answer": 1,
    "explain": "Using three independent factors (something you know, have, and are) provides the highest assurance.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 170,
    "q": "Which document in a PKI contains the operational and legal framework for how certificates are issued and managed?",
    "opts": ["Certificate Practice Statement (CPS)", "Certificate Revocation List (CRL)", "Certificate Policy (CP)", "OCSP Responder"],
    "answer": 1,
    "explain": "The CPS is the detailed “how we do it” document; CP is higher-level “what we do”.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 171,
    "q": "Which attack exploits the same-origin policy bypass by tricking a user into performing actions on a trusted site?",
    "opts": ["XSS", "CSRF (Cross-Site Request Forgery)", "Clickjacking", "Session fixation"],
    "answer": 1,
    "explain": "CSRF forces an authenticated user’s browser to send forged requests to a vulnerable site.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 172,
    "q": "Which of the following is the MOST effective way to prevent privilege escalation attacks?",
    "opts": ["Full-disk encryption", "Applying least privilege and removing unnecessary admin rights", "Antivirus software", "Network segmentation only"],
    "answer": 1,
    "explain": "Least privilege ensures users and processes run with minimal rights, blocking escalation paths.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 173,
    "q": "Which standard defines Evaluation Assurance Levels (EAL1–EAL7) for security products?",
    "opts": ["FIPS 140-3", "Common Criteria (ISO/IEC 15408)", "PCI DSS", "NIST SP 800-53"],
    "answer": 1,
    "explain": "Common Criteria uses Protection Profiles and EALs to certify security products.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 174,
    "q": "Which of the following is the PRIMARY reason to implement file integrity monitoring (FIM)?",
    "opts": ["To detect unauthorized changes to critical system files and configurations", "To back up files", "To encrypt files at rest", "To compress files"],
    "answer": 1,
    "explain": "FIM alerts on modifications to binaries, config files, and content that may indicate compromise.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 175,
    "q": "Which type of testing simulates a real attacker with no internal knowledge?",
    "opts": ["White-box", "Black-box", "Gray-box", "Red team"],
    "answer": 1,
    "explain": "Black-box testers have no prior knowledge or credentials, mimicking an external attacker.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 176,
    "q": "Which cryptographic algorithm is used by Bitcoin for proof-of-work?",
    "opts": ["ECDSA", "SHA-256", "Keccak-256", "Scrypt"],
    "answer": 1,
    "explain": "Bitcoin mining uses double SHA-256 hashing in its proof-of-work consensus.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 177,
    "q": "Which control is specifically designed to prevent tailgating into secure areas?",
    "opts": ["Security guard", "Mantrap", "CCTV", "Badge reader"],
    "answer": 1,
    "explain": "A mantrap allows only one person at a time to enter, physically preventing tailgating.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 178,
    "q": "Which of the following is the BEST metric to measure the effectiveness of a security awareness program?",
    "opts": ["Number of training sessions held", "Reduction in successful phishing simulations and reported incidents", "Number of employees trained", "Quiz scores"],
    "answer": 1,
    "explain": "Behavioral change and reduction in real incidents/phishing click rates are the true success indicators.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 179,
    "q": "Which protocol provides confidentiality and integrity for IP packets and is commonly used in site-to-site VPNs?",
    "opts": ["SSL/TLS", "IPsec", "PPTP", "L2TP"],
    "answer": 1,
    "explain": "IPsec operates at Layer 3 and provides encryption/authentication for entire IP packets.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 180,
    "q": "Which of the following is the PRIMARY purpose of a honeypot?",
    "opts": ["To store backups", "To distract and gather intelligence on attackers", "To host production services", "To filter malicious traffic"],
    "answer": 1,
    "explain": "Honeypots have no production purpose; they exist to be attacked and to study attacker TTPs.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 181,
    "q": "Which law protects the privacy and security of health information in the United States?",
    "opts": ["GLBA", "HIPAA", "FERPA", "COPPA"],
    "answer": 1,
    "explain": "HIPAA (Health Insurance Portability and Accountability Act) includes the Privacy and Security Rules for PHI/ePHI.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 182,
    "q": "Which of the following is the MOST secure way to store passwords?",
    "opts": ["Reversible encryption", "Using modern adaptive hashing algorithms (bcrypt, Argon2, PBKDF2) with salt", "Plaintext", "Simple hash (MD5/SHA-1)"],
    "answer": 1,
    "explain": "Slow, salted, adaptive hashing functions are the current best practice for password storage.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 183,
    "q": "Which type of access control is most appropriate for military and government systems handling classified data?",
    "opts": ["RBAC", "MAC (Mandatory Access Control)", "DAC", "ABAC"],
    "answer": 1,
    "explain": "MAC with security labels (e.g., Top Secret, Secret) is required for classified environments.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 184,
    "q": "Which of the following is the PRIMARY goal of digital forensics?",
    "opts": ["To prevent incidents", "To collect, preserve, and analyze evidence in a forensically sound manner", "To patch systems", "To restore data"],
    "answer": 1,
    "explain": "Forensics focuses on evidence integrity for legal or investigative purposes.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 185,
    "q": "Which attack is mitigated by implementing DNSSEC?",
    "opts": ["Pharming", "DNS cache poisoning / spoofing", "DDoS", "ARP spoofing"],
    "answer": 1,
    "explain": "DNSSEC cryptographically signs zone records to prevent forged responses.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 186,
    "q": "Which of the following is the BEST example of a deterrent control?",
    "opts": ["Firewall", "Warning banners and visible security cameras", "Encryption", "Intrusion detection system"],
    "answer": 1,
    "explain": "Deterrent controls discourage potential attackers (e.g., “You are being monitored” signs).",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 187,
    "q": "Which cloud model shares responsibility between the provider and customer, with the provider managing the platform and runtime?",
    "opts": ["IaaS", "PaaS (Platform as a Service)", "SaaS", "FaaS"],
    "answer": 1,
    "explain": "In PaaS, the customer manages application code and data; the provider manages OS, middleware, etc.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 188,
    "q": "Which of the following is the PRIMARY purpose of a Security Information and Event Management (SIEM) system?",
    "opts": ["To block attacks in real time", "To collect, correlate, and analyze logs from many sources for threat detection", "To perform vulnerability scanning", "To manage patches"],
    "answer": 1,
    "explain": "SIEM provides centralized log aggregation, correlation, alerting, and reporting.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 189,
    "q": "Which type of malware typically spreads via infected USB drives and was famously used in Stuxnet?",
    "opts": ["Ransomware", "Worm", "Trojan", "Spyware"],
    "answer": 1,
    "explain": "Stuxnet was a highly sophisticated worm that spread via USB and targeted SCADA systems.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 190,
    "q": "Which of the following is the MOST important consideration when selecting cryptographic algorithms?",
    "opts": ["Speed", "Current industry standards, key length, and resistance to known attacks", "Ease of implementation", "Vendor support"],
    "answer": 1,
    "explain": "Security strength and standardization (e.g., AES, SHA-3, ECDSA) trump performance alone.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 191,
    "q": "Which control would be MOST effective in preventing data leakage via email?",
    "opts": ["Firewall", "Data Loss Prevention (DLP) solution", "Antivirus", "VPN"],
    "answer": 1,
    "explain": "DLP scans outbound content and blocks sensitive data (PII, PCI, etc.) in emails.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 192,
    "q": "Which of the following is the PRIMARY advantage of using a bastion host (jump server)?",
    "opts": ["Improved performance", "Reduces the attack surface by forcing all admin access through a hardened, monitored system", "Provides load balancing", "Encrypts traffic automatically"],
    "answer": 1,
    "explain": "Bastion hosts centralize and log administrative access while exposing only one hardened system.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 193,
    "q": "Which standard is used for secure email communication and supports both encryption and digital signatures?",
    "opts": ["PGP", "S/MIME", "OpenPGP", "DKIM"],
    "answer": 1,
    "explain": "S/MIME is the widely adopted standard in enterprise environments using X.509 certificates.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 194,
    "q": "Which of the following is the BEST way to protect against birthday attacks on hash functions?",
    "opts": ["Use a longer hash output (e.g., SHA-256 or larger)", "Add salt", "Use HMAC", "Use digital signatures"],
    "answer": 1,
    "explain": "Birthday paradox requires ≈2^(n/2) attempts; doubling output length (256-bit vs 128-bit) exponentially increases effort.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 195,
    "q": "Which type of physical security control includes fences, lighting, and signage?",
    "opts": ["Detective", "Deterrent", "Preventive", "Corrective"],
    "answer": 1,
    "explain": "These controls deter potential intruders by making the facility appear difficult to breach.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 196,
    "q": "Which of the following is the PRIMARY purpose of configuration management?",
    "opts": ["To track software licenses", "To ensure systems are built and maintained in a known, secure, and approved state", "To monitor performance", "To automate backups"],
    "answer": 1,
    "explain": "Secure baselines, change control, and drift detection are core to configuration management.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 197,
    "q": "Which attack is most effectively mitigated by using HTTP Strict Transport Security (HSTS)?",
    "opts": ["SQL injection", "SSL stripping / downgrade attacks", "XSS", "CSRF"],
    "answer": 1,
    "explain": "HSTS forces browsers to only connect via HTTPS, preventing man-in-the-middle SSL stripping.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 198,
    "q": "Which of the following is the MOST reliable way to verify the integrity of a downloaded software package?",
    "opts": ["Compare file size", "Check digital signature using the publisher’s public key", "Run antivirus scan", "Read user reviews"],
    "answer": 1,
    "explain": "Digital signatures guarantee authenticity and integrity from the original publisher.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 199,
    "q": "Which control is used to detect unauthorized changes to critical files (e.g., /etc/passwd, system binaries)?",
    "opts": ["Antivirus", "File Integrity Monitoring (FIM)", "DLP", "IDS"],
    "answer": 1,
    "explain": "FIM calculates and monitors cryptographic hashes of important files and alerts on changes.",
    "video": "http://www.midkey.xyz"
  },
  {
    "id": 200,
    "q": "Which of the following is the PRIMARY reason organizations conduct red team engagements?",
    "opts": ["To achieve compliance", "To simulate a real advanced adversary with no rules of engagement limitations", "To find common vulnerabilities", "To test backup restoration"],
    "answer": 1,
    "explain": "Red teams operate like real APTs with full TTPs, often without the blue team’s knowledge.",
    "video": "http://www.midkey.xyz"
  }
]  

  